print("+++++++++++ МНОЖЕСТВА +++++++++++++")

cities = ["Moscow", "NYC", "Kazan'", "Paris", "NYC", "Paris"]  # это обычный лист имеющий повторяющиеся элементы
print(cities)  # множества  можно создавать из смешанных типов: mixed_set = {2.0, "Nicholas", (1, 2, 3)}
cities = set(cities)  # изменили тип переменной на МНОЖЕСТВО и теперь в этой переменной отсутствуют дубликаты
print(cities)
cars = {"honda", "mazda", "BMW"}  # множество обьявляется в фигурных скобках
cars.add("lada")  # добавление элемента
cars.remove("BMW")  # удаление, если элемента нет то выдаст ошибку
cars.discard("BMW")  # удаление, если элемента нет то никакой ошибки не выдаст
print(cars, "порядок вывода может каждый раз меняться если множество большое!")
print(sorted(cars))
print("BMW" in cars)  # вернет тру или фолс
plans = {}  # обьявление пустого множется не возможно - по дефолту это будет словарь
print(type(plans))

print("+++++++++++ ЗАДАЧА НА МНОЖЕСТВА  ++++++++++++")
# супруги собираются в отпуск, каждый из них взял какие-то вещи
# Максим взял
max_took = {"телефон", "бритва", "рубашка", "шорты"}
# Катя взяла
katya_took = {"телефон", "шорты", "зонтик", "помада"}
# Какие вещи взяли супруги
total_took = max_took | katya_took
print(total_took)
# Какие вещи повторятются
print(max_took & katya_took)
# Какие вещи взял Максим и не взяла Катя
print(max_took - katya_took)
# Какие вещи взяла Катя и не взял Максим
print(katya_took - max_took)






