# Практическое задание
# 1: Даны два произвольные списка. Удалите из первого списка элементы присутствующие во втором списке.
#     Примечание. Списки создайте вручную, например так:
my_list_1 = [1, 1, 1, 2, 2, 2, 3, 4]
my_list_2 = [2, 4, 5]

for i in my_list_1[:]:  # создав срез мы будем брать данные не из сиска а из копии
    if i in my_list_2:
        my_list_1.remove(i)
print(my_list_1)
print(my_list_2)

# 2: Дана дата в формате dd.mm.yyyy, например: 02.11.2013. Ваша задача — вывести дату в текстовом виде, например:
# второе ноября 2013 года. Склонением пренебречь (2000 года, 2010 года)
data = "01.01.2013"
d, m, y = data.split(".")
print(d, m, y)
days = {
    "01": "первое",
    "02": "второе",
    "03": "третье"
}
months = {
    "01": "jan",
    "02": "feb"
}
result = f'{days[d]} {months[m]} {y}'
print(result)  # либо можно print("{} {} {}".format(days[d], months[m], y))

# 3: Дан список заполненный произвольными целыми числами.
# Получите новый список, элементами которого будут только уникальные элементы исходного.
#     Примечание. Списки создайте вручную, В этом случае ответ будет: [5, 8]
my_list_1 = [2, 2, 5, 12, 8, 2, 12]
my_list_2 = []
print(my_list_1)

# for i in my_list_1:
#     my_list_1.remove(i)
#     if i not in my_list_1:
#         my_list_2.append(i)

for i in my_list_1:
    if my_list_1.count(i):
        my_list_2.append(i)

print(my_list_2)





