# Практическое задание
# 1: Создайте функцию, принимающую на вход имя, возраст и город проживания человека. Функция должна возвращать строку
# вида «Василий, 21 год(а), проживает в городе Москва»

def citizen(name="Mike", age="18", citi="NYC"):
    return name + ", " + age + " год(а), проживает в городе " + citi


print(citizen("Василий", "21", "Москва"))


# 2: Создайте функцию, принимающую на вход 3 числа и возвращающую наибольшее из них.

data = input("Введите 3 числа через запятую : ")
data = data.split(",")
data = list(map(int, data))
print(max(data))

# 3: Давайте опишем пару сущностей player и enemy через словарь, который будет иметь ключи и значения:
# name - строка полученная от пользователя,
# health = 100,
# damage = 50. ### Поэкспериментируйте с значениями урона и жизней по желанию. ### Теперь надо создать функцию
# attack(person1, person2). Примечание: имена аргументов можете указать свои.
# ### Функция в качестве аргумента будет принимать атакующего и атакуемого.
# ### В теле функция должна получить параметр damage атакующего и отнять это количество от health атакуемого.
# Функция должна сама работать со словарями и изменять их значения.


player = {
    "name": "Mike",
    "health": 150,
    "damage": 50,
    "armor": 1.2
}

enemy = {
    "name": "Vampire",
    "health": 130,
    "damage": 40,
    "armor": 1.2
}

while True:
    start = input("Start fight? Y/N : ")
    if start.lower() == "n":
        break

    def attack(a, b):
        b["health"] = b["health"] - damage_total(a, b)
        print(a["name"] + " attacked, now " + b["name"] + " has " + str(b["health"]) + " health.")
        if b["health"] > 0:
            a["health"] = a["health"] - int(b["damage"] / a["armor"])
            print(b["name"] + " attacked, now " + a["name"] + " has " + str(a["health"]) + " health.")


    def damage_total(a, b):
        x = int(a["damage"] / b["armor"])
        return x


    attack(player, enemy)

    if player["health"] <= 0:
        print(player["name"] + " killed by " + enemy["name"] + ". THE END.")
        break
    elif enemy["health"] <= 0:
        print(enemy["name"] + " killed by " + player["name"] + ". THE END.")
        break





# 4: Давайте усложним предыдущее задание. Измените сущности, добавив новый параметр - armor = 1.2 (величина брони персонажа)
# Теперь надо добавить новую функцию, которая будет вычислять и возвращать полученный урон по формуле damage / armor
# Следовательно, у вас должно быть 2 функции:
# Наносит урон. Это улучшенная версия функции из задачи 3.
# Вычисляет урон по отношению к броне.
#
# Примечание. Функция номер 2 используется внутри функции номер 1 для вычисления урона и вычитания его из здоровья персонажа.

